OpenNuvoton/M2351BSP/SampleCode/StdDriver/USBD_Mass_Storage_SDCard/MassStorage.c
        case 0x3F:
            *((uint8_t *)MassCMD_BUF) = 0x47;
            i = 8;
            for(j = 0; j < 12; j++, i++)
                *((uint8_t *)(MassCMD_BUF + i)) = s_au8ModePage_01[j];
            for(j = 0; j < 32; j++, i++)
                *((uint8_t *)(MassCMD_BUF + i)) = s_au8ModePage_05[j];
            for(j = 0; j < 12; j++, i++)
                *((uint8_t *)(MassCMD_BUF + i)) = s_au8ModePage_1B[j];
            for(j = 0; j < 8; j++, i++)
                *((uint8_t *)(MassCMD_BUF + i)) = s_au8ModePage_1C[j];

            NumHead = 2;
            NumSector = 64;
        NumCyl = (uint16_t)s_u32TotalSectors / 128;

            *((uint8_t *)(MassCMD_BUF + 24)) = NumHead;
            *((uint8_t *)(MassCMD_BUF + 25)) = NumSector;
            *((uint8_t *)(MassCMD_BUF + 28)) = (uint8_t)(NumCyl >> 8);
            *((uint8_t *)(MassCMD_BUF + 29)) = (uint8_t)(NumCyl & 0x00ff);
            break;

        default:
            s_au8SenseKey[0] = 0x05;
            s_au8SenseKey[1] = 0x24;
            s_au8SenseKey[2] = 0x00;
    }
}

void MSC_Write(void)
{
    uint32_t lba, len;

    if(s_u32OutSkip == 0)
    {
        if(s_u32Length > EP3_MAX_PKT_SIZE)
        {
            if(USBD_GET_EP_BUF_ADDR(EP3) == s_u32BulkBuf0)
            {
                USBD_SET_EP_BUF_ADDR(EP3, s_u32BulkBuf1);
                USBD_SET_PAYLOAD_LEN(EP3, EP3_MAX_PKT_SIZE);
                USBD_MemCopy((uint8_t *)s_u32Address, (uint8_t *)((uint32_t)USBD_BUF_BASE + s_u32BulkBuf0), EP3_MAX_PKT_SIZE);
            }
            else
            {
                USBD_SET_EP_BUF_ADDR(EP3, s_u32BulkBuf0);
                USBD_SET_PAYLOAD_LEN(EP3, EP3_MAX_PKT_SIZE);
                USBD_MemCopy((uint8_t *)s_u32Address, (uint8_t *)((uint32_t)USBD_BUF_BASE + s_u32BulkBuf1), EP3_MAX_PKT_SIZE);
            }

            s_u32Address += EP3_MAX_PKT_SIZE;
            s_u32Length -= EP3_MAX_PKT_SIZE;

            /* Buffer full. Writer it to storage first. */
            if(s_u32Address >= (STORAGE_DATA_BUF + STORAGE_BUFFER_SIZE))
            {
                //DataFlashWrite(s_u32DataFlashStartAddr, STORAGE_BUFFER_SIZE, (uint32_t)STORAGE_DATA_BUF);
                MSC_WriteMedia(s_u32DataFlashStartAddr, STORAGE_BUFFER_SIZE, (uint8_t *)STORAGE_DATA_BUF);
                s_u32Address = STORAGE_DATA_BUF;
                //s_u32DataFlashStartAddr += STORAGE_BUFFER_SIZE;
                s_u32DataFlashStartAddr += STORAGE_BUFFER_SIZE / UDC_SECTOR_SIZE;
            }
        }
        else
        {
            if(USBD_GET_EP_BUF_ADDR(EP3) == s_u32BulkBuf0)
                USBD_MemCopy((uint8_t *)s_u32Address, (uint8_t *)((uint32_t)USBD_BUF_BASE + s_u32BulkBuf0), s_u32Length);
            else
                USBD_MemCopy((uint8_t *)s_u32Address, (uint8_t *)((uint32_t)USBD_BUF_BASE + s_u32BulkBuf1), s_u32Length);
            s_u32Address += s_u32Length;
            s_u32Length = 0;


            if((s_sCBW.u8OPCode == UFI_WRITE_10) || (s_sCBW.u8OPCode == UFI_WRITE_12))
            {
                lba = get_be32(&s_sCBW.au8Data[0]);
                len = s_sCBW.dCBWDataTransferLength;

                //len = lba * UDC_SECTOR_SIZE + s_sCBW.dCBWDataTransferLength - s_u32DataFlashStartAddr;
                len = (lba - s_u32DataFlashStartAddr) * UDC_SECTOR_SIZE + s_sCBW.dCBWDataTransferLength;
                if(len)
                {
                    //DataFlashWrite(s_u32DataFlashStartAddr , len, (uint32_t)STORAGE_DATA_BUF);
                    MSC_WriteMedia(s_u32DataFlashStartAddr, len, (uint8_t *)STORAGE_DATA_BUF);
                }
            }

            s_u8BulkState = BULK_IN;
            MSC_AckCmd();
        }
    }
}

void MSC_ProcessCmd(void)
{
    uint32_t u32Len;
    uint32_t i;

    if(s_u8EP3Ready)
    {
        s_u8EP3Ready = 0;

        if(s_u8BulkState == BULK_CBW)
        {
            u32Len = USBD_GET_PAYLOAD_LEN(EP3);
            if(u32Len > 31) u32Len = 31;

            /* Check Signature & length of CBW */
            /* Bulk Out buffer */
            if((*(uint32_t *)((uint32_t)USBD_BUF_BASE + s_u32BulkBuf0) != CBW_SIGNATURE)/* || (u32Len != 31)*/)
            {

                USBD_SET_EP_STALL(EP2);
                USBD_SET_EP_STALL(EP3);
                USBD_LockEpStall(1 << EP3);

                s_u8BulkState = BULK_CBW;
                DBG_PRINTF("CBW signature fail. stall bulk out pipe\n");
                return;

            }

            /* Get the CBW */
            for(i = 0; i < u32Len; i++)
                *((uint8_t *)(&s_sCBW.dCBWSignature) + i) = *(uint8_t *)((uint32_t)USBD_BUF_BASE + s_u32BulkBuf0 + i);


            /* Prepare to echo the tag from CBW to CSW */
            s_sCSW.dCSWTag = s_sCBW.dCBWTag;

            /* Parse Op-Code of CBW */
            switch(s_sCBW.u8OPCode)
            {
                case UFI_PREVENT_ALLOW_MEDIUM_REMOVAL:
                {
                    if(s_sCBW.au8Data[2] & 0x01)
                    {
                        s_au8SenseKey[0] = 0x05;  //INVALID COMMAND
                        s_au8SenseKey[1] = 0x24;
                        s_au8SenseKey[2] = 0;
                        s_u8Prevent = 1;
                    }
                    else
                        s_u8Prevent = 0;
                    s_u8BulkState = BULK_IN;
                    MSC_AckCmd();
                    return;
                }
                case UFI_VERIFY_10:
                case UFI_START_STOP:
                case UFI_TEST_UNIT_READY:
                {
                    DBG_PRINTF("Test Unit\n");
                    s_u8BulkState = BULK_IN;
                    MSC_AckCmd();
                    return;
                }
                case UFI_REQUEST_SENSE:
                {
                    u32Len = s_sCBW.dCBWDataTransferLength;
                    if(u32Len > 18) u32Len = 18;

                    if(u32Len)
                    {
                        if(s_sCBW.dCBWDataTransferLength > u32Len)
                        {
                            /* Expecting a STALL after data phase completes with a zero-length or short packet */
                            USBD_SET_EP_STALL(EP2);
                            USBD_SET_EP_STALL(EP3);
                            USBD_LockEpStall((1 << EP2) | (1 << EP3));
                            return;
                        }

                        MSC_RequestSense();
                        s_u8BulkState = BULK_IN;
                        USBD_SET_PAYLOAD_LEN(EP2, u32Len);
                    }
                    else
                    {
                        /* Just skip data phase if zero data transfer length */
                        s_u8BulkState = BULK_IN;
                        MSC_AckCmd();
                    }
                    return;
                }
                case UFI_READ_FORMAT_CAPACITY:
                {
                    s_u32Length = s_sCBW.dCBWDataTransferLength;

