OpenNuvoton/M2351BSP/SampleCode/StdDriver/USBD_Mass_Storage_SDCard/MassStorage.c
                    /* format capacity descriptor length is fixed to be 12 bytes */
                    if(s_u32Length > 20) s_u32Length = 20;

                    s_u32Address = MassCMD_BUF;
                    MSC_ReadFormatCapacity();
                    s_u8BulkState = BULK_IN;
                    if(s_u32Length > 0)
                    {
                        if(s_u32Length > EP2_MAX_PKT_SIZE)
                            s_u32Size = EP2_MAX_PKT_SIZE;
                        else
                           s_u32Size = s_u32Length;

                        /* Bulk IN buffer */
                        USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + s_u32BulkBuf1), (uint8_t *)s_u32Address, s_u32Size);
                        s_u32BytesInStorageBuf = s_u32Size;

                        s_u32Address += s_u32Size;
                        USBD_SET_EP_BUF_ADDR(EP2, s_u32BulkBuf0);
                        MSC_Read();
                    }
                    return;
                }
                case UFI_READ_CAPACITY:
                case UFI_READ_CAPACITY_16:
                {
                    s_u32Length = s_sCBW.dCBWDataTransferLength;
                    if(s_u32Length > 36) s_u32Length = 36;
                    s_u32Address = MassCMD_BUF;

                    if(s_sCBW.u8OPCode == UFI_READ_CAPACITY)
                        MSC_ReadCapacity();
                    else
                        MSC_ReadCapacity16();

                    s_u8BulkState = BULK_IN;
                    if(s_u32Length > 0)
                    {
                        if(s_u32Length > EP2_MAX_PKT_SIZE)
                            s_u32Size = EP2_MAX_PKT_SIZE;
                        else
                            s_u32Size = s_u32Length;

                        /* Bulk IN buffer */
                        USBD_MemCopy((uint8_t *)((uint32_t)USBD_BUF_BASE + s_u32BulkBuf1), (uint8_t *)s_u32Address, s_u32Size);
                        s_u32BytesInStorageBuf = s_u32Size;

                        s_u32Address += s_u32Size;
                        USBD_SET_EP_BUF_ADDR(EP2, s_u32BulkBuf0);
                        MSC_Read();
                    }
                    return;
                }
                case UFI_MODE_SELECT_10:
                {
                    s_u32Length = s_sCBW.dCBWDataTransferLength;
                    s_u32Address = MassCMD_BUF;

                    if(s_u32Length > 0)
                    {
                        USBD_SET_PAYLOAD_LEN(EP3, EP3_MAX_PKT_SIZE);
                        s_u8BulkState = BULK_OUT;
                    }
                    return;
                }
                case UFI_MODE_SENSE_10:
                {
                    if(s_u32Length == 0)
                    {
                        s_u32Length = s_sCBW.dCBWDataTransferLength;
                        s_u32Address = MassCMD_BUF;
                    }

                    MSC_ModeSense10();
                    s_u8BulkState = BULK_IN;
                    if(s_u32Length > 0)
                    {
                        if(s_u32Length > EP2_MAX_PKT_SIZE)
                            s_u32Size = EP2_MAX_PKT_SIZE;
                        else
                            s_u32Size = s_u32Length;
                        /* Bulk IN buffer */
                        USBD_MemCopy((uint8_t *)((uint32_t)USBD_BUF_BASE + s_u32BulkBuf1), (uint8_t *)s_u32Address, s_u32Size);

                        s_u32Address += s_u32Size;

                        USBD_SET_EP_BUF_ADDR(EP2, s_u32BulkBuf0);
                        MSC_Read();
                    }
                    return;
                }
                case UFI_INQUIRY:
                {
                    uint8_t u8PageCode;


                    u32Len = s_sCBW.dCBWDataTransferLength;
                    /* Limit length */
                    if(u32Len > 36) u32Len = 36;

                    u8PageCode = s_sCBW.au8Data[0];


                    s_u8BulkState = BULK_IN;
                    if(u32Len)
                    {
                        /* u8PageCode should be zero */
                        if(u8PageCode)
                        {
                            /* Expecting a STALL after data phase completes with a zero-length or short packet */
                            //USBD_SET_EP_STALL(EP0);
                            USBD_SET_EP_STALL(EP3);
                            USBD_LockEpStall(1 << EP3);

                            DBG_PRINTF("INQUIRY page code = %d", u8PageCode);
                        }
                        /* Bulk IN buffer */
                        USBD_MemCopy((uint8_t *)((uint32_t)USBD_BUF_BASE + s_u32BulkBuf1), (uint8_t *)s_au8InquiryID, u32Len);
                        USBD_SET_PAYLOAD_LEN(EP2, u32Len);

                        DBG_PRINTF("Inquiry, len %d\n", u32Len);


                    }
                    else
                    {
                        /* Next is status phase if zero data length in data phase */
                        MSC_AckCmd();
                    }

                    return;
                }
                case UFI_READ_10:
                case UFI_READ_12:
                {
                    /* Check if it is a new transfer */
                    if(s_u32Length == 0)
                    {
                        /* Prepare the data for Bulk IN transfer */

                        /* Get LBA address */
                        s_u32Address = get_be32(&s_sCBW.au8Data[0]);
                        s_u32LbaAddress = s_u32Address;
                        s_u32Length = s_sCBW.dCBWDataTransferLength;
                        s_u32BytesInStorageBuf = s_u32Length;

                        DBG_PRINTF("Read addr=0x%x, len=0x%x\n", s_u32LbaAddress, s_u32Length);

                        /* Error check  */
                        if((s_u32LbaAddress > s_u32TotalSectors) || (s_u32LbaAddress + s_u32Length / UDC_SECTOR_SIZE > s_u32TotalSectors))
                        {

                            USBD_SET_EP_STALL(EP2);
                            USBD_SET_EP_STALL(EP3);
                            USBD_LockEpStall((1 << EP2) | (1 << EP3));

                            DBG_PRINTF("Stall ep2, ep3. addr=0x%x, len=0x%x\n", s_u32LbaAddress, s_u32Length);

                            return;
                        }


