OpenNuvoton/M2351BSP/SampleCode/StdDriver/USBD_Mass_Storage_SDCard/MassStorage.c
                    s_sCSW.dCSWDataResidue = s_sCBW.dCBWDataTransferLength - 36;
                    s_sCSW.bCSWStatus = 0;
                    DBG_PRINTF("Inquiry size > 36\n");
                }
                else
                {
                    s_sCSW.dCSWDataResidue = 0;
                    s_sCSW.bCSWStatus = 0;
                    DBG_PRINTF("Inquiry ack, %x\n", USBD->EP[2].CFGP);
                }
                break;
            }

            case UFI_PREVENT_ALLOW_MEDIUM_REMOVAL:
            case UFI_VERIFY_10:
            case UFI_START_STOP:
            case UFI_WRITE_10:
            case UFI_WRITE_12:
            {
                if (s_sCBW.dCBWDataTransferLength < STORAGE_BUFFER_SIZE)
                    s_sCSW.dCSWDataResidue = 0;
                else
                    s_sCSW.dCSWDataResidue = s_sCBW.dCBWDataTransferLength - STORAGE_BUFFER_SIZE;

                s_sCSW.bCSWStatus = 0;
                break;
            }
            case UFI_TEST_UNIT_READY:
            {
                s_sCSW.dCSWDataResidue = 0;
                s_sCSW.bCSWStatus = 0;
                break;
            }
            case UFI_MODE_SENSE_6:
            {
                s_sCSW.dCSWDataResidue = s_sCBW.dCBWDataTransferLength - 4;
                s_sCSW.bCSWStatus = 0;
                break;
            }
            default:
            {
                // Unknown command
                //USBD_SET_EP_STALL(EP2);
                //USBD_SET_EP_STALL(EP3);
                //USBD_LockEpStall(1 << EP3);
                s_sCSW.dCSWDataResidue = s_sCBW.dCBWDataTransferLength;
                s_sCSW.bCSWStatus = 1; // return command failed
                break;
            }
        }

        /* Return the CSW */
        USBD_SET_EP_BUF_ADDR(EP2, s_u32BulkBuf1);

        /* Bulk IN buffer */
        USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + s_u32BulkBuf1), (uint8_t *)&s_sCSW.dCSWSignature, 16);

        s_u8BulkState = BULK_CSW;
        USBD_SET_PAYLOAD_LEN(EP2, 13);

        DBG_PRINTF("Prepare CSW\n");
    }
    else
    {
        // This should be a DATA phase error.
        USBD_SET_EP_STALL(EP2);
        USBD_SET_EP_STALL(EP3);
        USBD_LockEpStall((1 << EP2) | (1 << EP3));

        DBG_PRINTF("Unexpected IN ack\n");
    }
}

void MSC_ReadMedia(uint32_t addr, uint32_t size, uint8_t *buffer)
{
    SpiRead(addr, size, buffer);
}

void MSC_WriteMedia(uint32_t addr, uint32_t size, uint8_t *buffer)
{
    SpiWrite(addr, size, buffer);
}

void MSC_SetConfig(void)
{
    // Clear stall status and ready
    USBD->EP[2].CFGP = 1;
    USBD->EP[3].CFGP = 1;
    /*****************************************************/
    /* EP2 ==> Bulk IN endpoint, address 2 */
    USBD_CONFIG_EP(EP2, USBD_CFG_EPMODE_IN | BULK_IN_EP_NUM);
    /* Buffer range for EP2 */
    USBD_SET_EP_BUF_ADDR(EP2, EP2_BUF_BASE);

    /* EP3 ==> Bulk Out endpoint, address 3 */
    USBD_CONFIG_EP(EP3, USBD_CFG_EPMODE_OUT | BULK_OUT_EP_NUM);
    /* Buffer range for EP3 */
    USBD_SET_EP_BUF_ADDR(EP3, EP3_BUF_BASE);

    /* trigger to receive OUT data */
    USBD_SET_PAYLOAD_LEN(EP3, EP3_MAX_PKT_SIZE);


    USBD_LockEpStall(0);

    s_u8BulkState = BULK_CBW;


    DBG_PRINTF("Set config\n");

}

/*** (C) COPYRIGHT 2019 Nuvoton Technology Corp. ***/
